#### Connecting to a Database

In [11]:
import sqlite3
connection = sqlite3.connect("test_database.sqlite") #it will connect to that DB. if it does not exist, it creates
cursor = connection.cursor() #it allow us to execute queries.
print("SQLite Database connection established.")

SQLite Database connection established.

After performed an operation on the database other than sending queries, we need to commit those changes via the .commit() method before we close the connection:

In [5]:
# connection.commit()
# connection.close()
# print("SQLite Database connection closed now.")

SQLite Database connection closed now.

#### 2. Creating a Table

In [29]:
cursor.execute('''CREATE TABLE IF NOT EXISTS school 
                  (Id INT PRIMARY KEY,
                  Name TEXT NOT NULL,
                  Age INT NOT NULL,
                  Address CHAR(50),
                  MARKS INT);''')
cursor.execute("DELETE FROM school") # for deleting the table data completely

cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) VALUES (1, 'Rohan', 14, 'Delhi', 200)");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) VALUES (2, 'Allen', 14, 'Bangalore', 150 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) VALUES (3, 'Martha', 15, 'Hyderabad', 200 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) VALUES (4, 'Palak', 15, 'Kolkata', 650)");

# cursor.execute("TRUNCATE FROM school") # for deleting the table data completely

for row in cursor.execute("SELECT id, name, marks from SCHOOL"):
    print("ID = {}, NAME = {}, MARKS = {}".format(row[0], row[1], row[2]))

connection.execute("UPDATE SCHOOL set MARKS = 250 where ID = 3")

print("*"*25,"below details got updated","*"*25)

for row in cursor.execute("SELECT id, name, marks from SCHOOL"):
    print("ID = {}, NAME = {}, MARKS = {}".format(row[0], row[1], row[2]))
    
    

#close the connection before you leave.
connection.commit()
connection.close()

ID = 1, NAME = Rohan, MARKS = 200
ID = 2, NAME = Allen, MARKS = 150
ID = 3, NAME = Martha, MARKS = 200
ID = 4, NAME = Palak, MARKS = 650
************************* below details got updated *************************
ID = 1, NAME = Rohan, MARKS = 200
ID = 2, NAME = Allen, MARKS = 150
ID = 3, NAME = Martha, MARKS = 250
ID = 4, NAME = Palak, MARKS = 650

In [30]:
#reading the table in with pandas dataframe
import pandas as pd
pd.read_sql_query("SELECT * FROM school", connection) # all we need to do is just passing the connection objec

   Id    Name  Age    Address  MARKS
0   1   Rohan   14      Delhi    200
1   2   Allen   14  Bangalore    150
2   3  Martha   15  Hyderabad    250
3   4   Palak   15    Kolkata    650

Ref: https://medium.com/analytics-vidhya/programming-with-databases-in-python-using-sqlite-4cecbef51ab9